
public class Data_repairer {
  public static void main(String[
  ] args) {
	  System.out.println("
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::: ÛÛÛÛÛÛÛÛ::::: ÛÛÛ:::: ÛÛÛÛÛÛÛÛ:::::ÛÛÛ:::::::'ÛÛÛÛÛÛÛÛ:::ÛÛÛÛÛÛÛÛ: ÛÛÛÛÛÛÛÛ::::::ÛÛÛ:::':ÛÛÛÛ::ÛÛÛÛÛÛÛ:':ÛÛÛÛÛÛÛ:'ÛÛÛÛÛÛÛÛ::::
::: ÛÛ:::. ÛÛ:::'ÛÛ ÛÛ:::... ÛÛ...::: ÛÛ ÛÛ:::::: ÛÛ.... ÛÛ::ÛÛ.....:: ÛÛ.... ÛÛ::: ÛÛ ÛÛ:::: ÛÛ:: ÛÛ....ÛÛ::ÛÛ....:::ÛÛ.... ÛÛ:::
::: ÛÛ:::: ÛÛ:: ÛÛ:. ÛÛ::::: ÛÛ::::: ÛÛ:. ÛÛ::::: ÛÛ:::: ÛÛ::ÛÛ::::::: ÛÛ:::: ÛÛ:: ÛÛ:. ÛÛ::: ÛÛ:: ÛÛ::::ÛÛ::ÛÛ:::::::ÛÛ:::: ÛÛ:::
::: ÛÛ:::: ÛÛ: ÛÛ:::. ÛÛ:::: ÛÛ:::: ÛÛ:::. ÛÛ:::: ÛÛÛÛÛÛÛÛ:::ÛÛÛÛÛÛ::: ÛÛÛÛÛÛÛÛ:: ÛÛ:::. ÛÛ:: ÛÛ:: ÛÛÛÛÛÛÛ:::ÛÛÛÛÛ::::ÛÛÛÛÛÛÛÛ::::
::: ÛÛ:::: ÛÛ: ÛÛÛÛÛÛÛÛÛ:::: ÛÛ:::: ÛÛÛÛÛÛÛÛÛ:::: ÛÛ.. ÛÛ::::ÛÛ...:::: ÛÛ.....::: ÛÛÛÛÛÛÛÛÛ:: ÛÛ:: ÛÛ.. ÛÛ:::ÛÛ...::::ÛÛ...ÛÛ:::::
::: ÛÛ:::: ÛÛ: ÛÛ.... ÛÛ:::: ÛÛ:::: ÛÛ.... ÛÛ:::: ÛÛ::. ÛÛ:::ÛÛ::::::: ÛÛ:::::::: ÛÛ.... ÛÛ:: ÛÛ:: ÛÛ::. ÛÛ::ÛÛ:::::::ÛÛ::..ÛÛ::::
::: ÛÛÛÛÛÛÛÛ:: ÛÛ:::: ÛÛ:::: ÛÛ:::: ÛÛ:::: ÛÛ:::: ÛÛÛ::. ÛÛ::ÛÛÛÛÛÛÛÛ: ÛÛ:::::::: ÛÛ:::: ÛÛ: ÛÛÛÛ: ÛÛÛ::. ÛÛ:ÛÛÛÛÛÛÛ::ÛÛ:::..ÛÛ:::
:::........:::..:::::..:::::..:::::..:::::..:::::..:::::..::........::..:::::::::..:::::..::....::..:::::..::........::..:::::..::
echo. ");
  }
}